{
  "error registering to event: user already registered to this event":
    "O usuário já está registrado neste evento",
  "error unregistering from event: user is not registered to this event":
    "O usuário não está registrado neste evento",
  "unregistered from event": "Desregistrado do evento",
  "registered to event": "Registrado no evento",
  "deleted activity": "Atividade apagada",
  "user must be registered to the event first":
    "O usuário deve estar registrado no evento primeiro",
  "registered to activity successfully": "Registrado na atividade com sucesso",
  "registered to standalone activity successfully":
    "Registrado na atividade independente com sucesso",
  "unregistered from activity successfully": "Desregistrado da atividade com sucesso",
  "unregistered from standalone activity successfully":
    "Desregistrado da atividade independente com sucesso",
  "error creating activity: activity must be scheduled within event timeframe":
    "A atividade deve ser agendada dentro do período do evento",
  "error updating activity: activity must be scheduled within event timeframe":
    "A atividade deve ser agendada dentro do período do evento",
  "attendance marked successfully": "Presença marcada com sucesso",
  "attendance removed successfully": "Presença removida com sucesso",
  "error unregistering from activity: user has already attended this activity":
    "O usuário já participou desta atividade",
  "deleted product": "Produto apagado",
  "error processing purchase: payment method id is required": "Método de pagamento é obrigatório",
  "error starting pix purchase: product has expired": "O produto expirou",
  "error updating product: product can't expire after event end date":
    "O produto não pode expirar após a data de término do evento",
  "error registering to activity: user has another activity registered at the same time that is not palestra":
    "O usuário já tem outra atividade registrada no mesmo horário que não é palestra",
  "refresh token revoked successfully": "Permissão de Login revogado com sucesso",
  "error registering user: user already exists": "Usuário já existe",
  "error registering to activity: user must be registered to the event first": "O usuário precisa estar registrado no evento",
  "error trying to login: invalid password": "Credenciais inválidas",
  "error trying to login: record not found": "Credenciais inválidas",
  "error promoting user: users cannot promote themselves": "Usuários não podem se promover",
  "error demoting user: users cannot demote themselves": "Usuários não podem se rebaixar",
  "error demoting user: target user not found: record not found": "Usuário alvo não encontrado",
  "error promoting user: target user not found: record not found": "Usuário alvo não encontrado",
  "error demoting user: user is not an admin of this event": "Usuário não é um administrador deste evento",
  "error promoting user: user must be registered to the event to be promoted":
    "Usuário deve estar registrado no evento para ser promovido",
  "promoted user": "O Usuário foi promovido",
  "demoted user": "O Usuário foi rebaixado",
  "error registering to activity: activity has already ended": "O período de inscrição da atividade já encerrou!",
  "error registering to activity: this activity requires a token or payment": "Essa atividade necessita de tokens ou pagamento",
  "error registering to activity: user does not have any available tokens": "Você não possui nenhum token disponível",
  "user name changed successfully": "Seu nome foi alterado com sucesso!",
  "account verification required": "É necessário verificar a conta",
  "password reset email sent": "E-mail de redefinição de senha enviado",
  "logged out successfully": "Logout realizado com sucesso",
  "registration already exists: failed to register to activity: user already registered to this activity":
    "O usuário já está inscrito nesta atividade",
  "refresh token not found or revoked": "Você não tem permissão de acesso",
  "error starting pix purchase: not enough quantity available, want {n} have {n}":
    "Quantidade insuficiente disponível, desejado {n}, disponível {n}",
  "error starting pix purchase: user is not registered to this event": "O usuário não é registrado no evento",
  "error unregistering from activity: this activity requires a token or payment": "Essa atividade necessita de token ou pagamento",
  "error getting user info: could not find user to gift": "Usuário não encontrado!",
  "error getting user info: user is not registered to the event of the product":
    "Usuário não está registrado no evento do produto!",
  "error getting user info: not enough quantity available, want {n} have {n}": 
    "Quantidade insuficiente disponível, desejado {n}, disponível {n}",
  "error getting user info: user with {n} of this product is trying to buy {n}, max ownable quantity is {n}, this exceeds it by {n}":
    "O usuário em questão já possui {n} deste produto, tentativa de adicionar {n}. O máximo permitido é {n}, excedendo em {n}.",
  "activity is at full capacity: maximum capacity reached": "A atividade está lotada!",
  "error processing purchase: user is not registered to this event": "É necessário estar registrado no evento para comprar",
  "error unregistering from event: cannot unregister from event where you bought products":
    "Não é possível remover a inscrição de um evento, o qual você comprou algum produto",
  "error removing attendance: unauthorized: only master admins, event creators, or super users can remove attendance":
    "Apenas ADMIN Mestre, criador de evento ou super usuário podem remover presença",
  "error getting user info: cannot gift yourself": "Não é possível dar presentes a si mesmo.",
  "error promoting user: cannot promote event creator or super user":
    "Não é possível promover criador de evento ou super usuário",
  "error demoting user: cannot demote event creator or super user":
    "Não é possível rebaixar criador de evento ou super usuário",
  "error promoting user: user is already a master admin": 
  "O usuário já é um ADMIN Mestre, não é possível o promover mais",
  "user is not registered to event": "O usuário não está registrado no evento",
  "user doesnt have event ticket": "O usuário não tem o ticket do evento!",
  "unauthorized: only admins can get is-paid status": "Essa função é apenas para ADMIN",
  "deleted event": "Evento deletado",
  "user already registered to this coffee": "O usuário já está registrado nesse coffee",
  "could not get user product": "Não foi possível identificar o produto",
  "registered to coffee": "Usuário registrado no Coffee Break",
  "unregistered from coffee": "Usuário foi desregistrado do Coffee Break",
  "coffee does not belong to this event": "Esse Coffee Break não pertence a esse evento",
  "user is not registered to this coffee": "O usuário não está registrado nesse Coffee Break",
  "error unregistering from coffee: error checking if user is registered to coffee":
    "Erro ao verificar se o usuário está inscrito no coffee",
  "error registering to coffee: user doesnt have event ticket": "O usuário não tem o ticket do evento!",
  "error registering to coffee: user is not registered to event": "O usuário não está registrado no evento!",
  "error registering to coffee: user already registered to this coffee": "O usuário já está registrado no coffee",
  "error unregistering from coffee: user is not registered to this coffee":
    "O usuário não está registrado no coffee"
}
